#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/arconsis-benchmarks/server-benchmarks-ecr/runs/run-akZKi5RnGDHHYADR

Waiting for the plan to start...

Terraform v1.5.6
on linux_amd64
Initializing plugins and modules...
module.ecr["bookstore-vapor"].aws_ecr_repository.main: Refreshing state... [id=bookstore-vapor]
module.ecr["bookstore-actix"].aws_ecr_repository.main: Refreshing state... [id=bookstore-actix]
module.ecr["bookstore-nestjs"].aws_ecr_repository.main: Refreshing state... [id=bookstore-nestjs]
module.ecr["bookstore-quarkus-sync"].aws_ecr_repository.main: Refreshing state... [id=bookstore-quarkus-sync]
module.ecr["bookstore-quarkus-sync"].aws_ecr_lifecycle_policy.main: Refreshing state... [id=bookstore-quarkus-sync]
module.ecr["bookstore-nestjs"].aws_ecr_lifecycle_policy.main: Refreshing state... [id=bookstore-nestjs]
module.ecr["bookstore-actix"].aws_ecr_lifecycle_policy.main: Refreshing state... [id=bookstore-actix]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ecr["bookstore-quarkus"].aws_ecr_lifecycle_policy.main will be created
  + resource "aws_ecr_lifecycle_policy" "main" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "bookstore-quarkus"
    }

  # module.ecr["bookstore-quarkus"].aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "bookstore-quarkus"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ecr["bookstore-springboot"].aws_ecr_lifecycle_policy.main will be created
  + resource "aws_ecr_lifecycle_policy" "main" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "bookstore-springboot"
    }

  # module.ecr["bookstore-springboot"].aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "bookstore-springboot"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ecr["bookstore-vapor"].aws_ecr_repository.main will be destroyed
  - resource "aws_ecr_repository" "main" {
      - arn                  = "arn:aws:ecr:eu-west-1:143441946271:repository/bookstore-vapor" -> null
      - id                   = "bookstore-vapor" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "bookstore-vapor" -> null
      - registry_id          = "143441946271" -> null
      - repository_url       = "143441946271.dkr.ecr.eu-west-1.amazonaws.com/bookstore-vapor" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 5 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @akoufa, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform ECR`*